artifacts/packs/openfoam-ecm-standalone_lumped_premeshed_20260330_100302/cases/lumped_solid/0/jellyRoll/ecmQdot
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       volScalarField;
    location    "0/jellyRoll";
    object      ecmQdot;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    jellyRoll_to_shell
    {
        type            zeroGradient;
    }
    jellyRoll_to_cap
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
